IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cpu_sys_regs.xml
<module id="CPU_SYS_REGS" HW_revision="" description="CPU SYS Registers">
	<register id="CPUSYSLOCK1" width="32" page="1" offset="0x0" internal="0" description="Lock bit for CPUSYS registers">
		<bitfield id="PIEVERRADDR" description="Lock bit for PIEVERRADDR Register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR0" description="Lock bit for PCLKCR0 Register" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR1" description="Lock bit for PCLKCR1 Register" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR2" description="Lock bit for PCLKCR2 Register" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR3" description="Lock bit for PCLKCR3 Register" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR4" description="Lock bit for PCLKCR4 Register" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR6" description="Lock bit for PCLKCR6 Register" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR7" description="Lock bit for PCLKCR7 Register" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR8" description="Lock bit for PCLKCR8 Register" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR9" description="Lock bit for PCLKCR9 Register" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR10" description="Lock bit for PCLKCR10 Register" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR11" description="Lock bit for PCLKCR11 Register" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR13" description="Lock bit for PCLKCR13 Register" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR14" description="Lock bit for PCLKCR14 Register" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR16" description="Lock bit for PCLKCR16 Register" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="LPMCR" description="Lock bit for LPMCR Register" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIOLPMSEL0" description="Lock bit for GPIOLPMSEL0 Register" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIOLPMSEL1" description="Lock bit for GPIOLPMSEL1 Register" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR17" description="Lock bit for PCLKCR17 Register" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR18" description="Lock bit for PCLKCR18 Register" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR20" description="Lock bit for PCLKCR20 Register" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR21" description="Lock bit for PCLKCR21 Register" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR22" description="Lock bit for PCLKCR22 Register" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR23" description="Lock bit for PCLKCR23 Register" begin="30" end="30" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSYSLOCK2" width="32" page="1" offset="0x2" internal="0" description="Lock bit for CPUSYS registers">
		<bitfield id="ETHERCATCTL" description="Lock bit for ETHERCATCTL register" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEVERRADDR" width="32" page="1" offset="0xa" internal="0" description="PIE Vector Fetch Error Address register">
		<bitfield id="ADDR" description="PIE Vector Fetch Error Handler Routine Address" begin="21" end="0" width="22" rwaccess="RW"/>
	</register>
	<register id="ETHERCATCTL" width="32" page="1" offset="0xc" internal="0" description="ETHERCAT control register.">
		<bitfield id="I2CLOOPBACK" description="Loopback I2C port of etherCAT IP to I2C_A." begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR0" width="32" page="1" offset="0x22" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="CLA1" description="CLA1 Clock Enable Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DMA" description="DMA Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CPUTIMER0" description="CPUTIMER0 Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CPUTIMER1" description="CPUTIMER1 Clock Enable bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CPUTIMER2" description="CPUTIMER2 Clock Enable bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CPUBGCRC" description="CPUBGCRC Clock Enable Bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CLA1BGCRC" description="CLA1BGCRC Clock Enable Bit" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="HRCAL" description="HRCAL Clock Enable Bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="TBCLKSYNC" description="EPWM Time Base Clock sync" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GTBCLKSYNC" description="EPWM Time Base Clock Global sync" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="ERAD" description="ERAD module clock enable" begin="24" end="24" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR1" width="32" page="1" offset="0x24" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="EMIF1" description="EMIF1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EMIF2" description="EMIF2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR2" width="32" page="1" offset="0x26" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="EPWM1" description="EPWM1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EPWM2" description="EPWM2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EPWM3" description="EPWM3 Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EPWM4" description="EPWM4 Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EPWM5" description="EPWM5 Clock Enable bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EPWM6" description="EPWM6 Clock Enable bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EPWM7" description="EPWM7 Clock Enable bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EPWM8" description="EPWM8 Clock Enable bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="EPWM9" description="EPWM9 Clock Enable bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="EPWM10" description="EPWM10 Clock Enable bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="EPWM11" description="EPWM11 Clock Enable bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="EPWM12" description="EPWM12 Clock Enable bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="EPWM13" description="EPWM13 Clock Enable bit" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="EPWM14" description="EPWM14 Clock Enable bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="EPWM15" description="EPWM15 Clock Enable bit" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="EPWM16" description="EPWM16 Clock Enable bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR3" width="32" page="1" offset="0x28" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="ECAP1" description="ECAP1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ECAP2" description="ECAP2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ECAP3" description="ECAP3 Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ECAP4" description="ECAP4 Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ECAP5" description="ECAP5 Clock Enable bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ECAP6" description="ECAP6 Clock Enable bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ECAP7" description="ECAP7 Clock Enable bit" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
