IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cpu_sys_regs.xml
	<register id="PCLKCR4" width="32" page="1" offset="0x2a" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="EQEP1" description="EQEP1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EQEP2" description="EQEP2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EQEP3" description="EQEP3 Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR6" width="32" page="1" offset="0x2e" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="SD1" description="SD1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SD2" description="SD2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR7" width="32" page="1" offset="0x30" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="SCI_A" description="SCI_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SCI_B" description="SCI_B Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SCI_C" description="SCI_C Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SCI_D" description="SCI_D Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR8" width="32" page="1" offset="0x32" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="SPI_A" description="SPI_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SPI_B" description="SPI_B Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SPI_C" description="SPI_C Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SPI_D" description="SPI_D Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR9" width="32" page="1" offset="0x34" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="I2C_A" description="I2C_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="I2C_B" description="I2C_B Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR10" width="32" page="1" offset="0x36" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="CAN_A" description="CAN_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CAN_B" description="CAN_B Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR11" width="32" page="1" offset="0x38" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="McBSP_A" description="McBSP_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="McBSP_B" description="McBSP_B Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="USB_A" description="USB_A Clock Enable bit" begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR13" width="32" page="1" offset="0x3c" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="ADC_A" description="ADC_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADC_B" description="ADC_B Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADC_C" description="ADC_C Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADC_D" description="ADC_D Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR14" width="32" page="1" offset="0x3e" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="CMPSS1" description="CMPSS1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2" description="CMPSS2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3" description="CMPSS3 Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4" description="CMPSS4 Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS5" description="CMPSS5 Clock Enable bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS6" description="CMPSS6 Clock Enable bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS7" description="CMPSS7 Clock Enable bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS8" description="CMPSS8 Clock Enable bit" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR16" width="32" page="1" offset="0x42" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="DAC_A" description="Buffered_DAC12_1 Clock Enable Bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="DAC_B" description="Buffered_DAC12_2 Clock Enable Bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="DAC_C" description="Buffered_DAC12_3 Clock Enable Bit" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR17" width="32" page="1" offset="0x44" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="CLB1" description="CLB1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLB2" description="CLB2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLB3" description="CLB3 Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLB4" description="CLB4 Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR18" width="32" page="1" offset="0x46" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="FSITX_A" description="FSITX_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FSITX_B" description="FSITX_B Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_A" description="FSIRX_A Clock Enable bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_B" description="FSIRX_B Clock Enable bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_C" description="FSIRX_C Clock Enable bit" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_D" description="FSIRX_D Clock Enable bit" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_E" description="FSIRX_E Clock Enable bit" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_F" description="FSIRX_F Clock Enable bit" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_G" description="FSIRX_G Clock Enable bit" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_H" description="FSIRX_H Clock Enable bit" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR20" width="32" page="1" offset="0x4a" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="PMBUS_A" description="PMBUS_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR21" width="32" page="1" offset="0x4c" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="DCC0" description="DCC0 Clock Enable Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DCC1" description="DCC1 Clock Enable Bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DCC2" description="DCC2 Clock Enable Bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR22" width="32" page="1" offset="0x4e" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="PBISTCLK" description="PBISTCLK Clock Enable Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR23" width="32" page="1" offset="0x50" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="ETHERCAT" description="ETHERCAT Clock Enable Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
